<html lang="es">
<head>
  <title>Intrucci&oacute;nes para Karrito</title>
  <link rel="stylesheet" type="text/css" href="helphtml.css">
</head>
<body>
<page>
<p class="tbanner">
Translations :
<a href="ostoshelp-fi.html">suomi</a>
<a href="ostoshelp-es.html">espa&ntilde;ol</a>
<a href="ostoshelp-de.html">Deutsch</a>
<a href="ostoshelp.html">English</a>
</p>
<H1>Como usar Karrito</h1>
<H2>Introduccion</H2>
<p>
El Karrito es una application de lista de compras. &Eacute;s artesanal, creado a mano para su uso.
</p>
<p>
La Kompra recordar&aacute; los articulos que has puesto a la lista, pero no lo conta a nadie!
Nacido libre de publicidad y sin lianzas de negocio... por que ahora la lista est&aacute; desconectado del internet.
&iexcl;Que lo usas y disfrutes!
</p>
<H2>P&aacute;gina de lista de compra</H2>
<p>
El primer p&aacute;gina que se ve, es la lista.
En principio es vacio, antes de a&ntilde&adir articulos a comprar.
<p>
Puedes a&ntilde;adir articulos yendo a p&aacute&gina de busqueda, por deslizando izquierda, tocando la lupa, o cogiendo la opci&oacute;n "Busca y agrega" de la tiromenu.
<br/>
Los articulos tienen un estado, que se indica por un icono a la izquierda. El estado se puede cambiar entre "a comprar" y "ya comprado" comprado como haciendo clic en el icono.
<br/>
<ul>
<li class="nobullet"><img src="../../images/graphic-toggle-on.png" /> <!--//<img src=\"../../images/graphic-toggle-on.png\" -->
a comprar</li>
<li class="nobullet"><img src="../../images/graphic-toggle-off.png" />ya comprado</li>
<li class="nobullet"><img src="../../images/icon-s-task.png" />marcado, con bander&iacute;n. - Usa lo como quieras ;-)</li>
</ul>
<p>Un art&iacute;culo puede tambi&eacute;n ser escondido, as&iacute; no ser&aacute; visible en la lista.</p>
</ul>
<p>
El menu contexto tiene opciones a:
</p>
<ul>
  <li class="nobullet"><img src="../../images/icon-m-dismiss.png" />esconder</li>
  <li class="nobullet"><img src="../../images/icon-s-task.png" />marcar</li>
  <li class="nobullet"><img src="../../images/icon-m-keyboard.png" />editar</li>
  <li class="nobullet"><img src="../../images/icon-m-up.png" />aumentar cantidad</li>
  <li class="nobullet"><img src="../../images/icon-m-down.png" />disminuir cantidad</li>
  <li class="nobullet"><img src="../../images/icon-m-delete.png" />borrar el art&iacute;culo</li>
</ul>
<!-- The icon paths WERE:
/usr/share/themes/jolla-ambient/meegotouch/icons/
/usr/share/themes/jolla-ambient/meegotouch/z1.0/icons/ (for up and down)
The paths worked on emulator, but not on device.
Correct paths for device are:
/usr/share/themes/sailfish-default/meegotouch/z1.0/icons/
/usr/share/themes/sailfish-default/meegotouch/icons
-->
<p>
A&ntilde;ade nuevos art&iacute;culos por p&aaccute;gina de busqueda.
</p> 
<H2>Menu deslizante de arriba</H2>
<p>
Opciones:
<ul>
  <li>Busca y agrega - art&iacute;culos a la lista. El mismo que deslizar la p&aacute; a la izquierda</li>
  <li>Esconder comprados - cuando no m&aacute; quieres ver los que ya lo tienes</li>
  <li>Editar tiendas - para que tienes algo con que filtrar tu lista de compras</li>
  <li>Ajustes</li>
  <li>Instrucci&oacute;nes - este p&aacute;gina</li>
</ul>
</p>
<H2>Navegaci&oacute;n</H2>
<p>
Navegaci&oacute;n flujo deslizante s&iacute; va. Deslizar izquierda para a&ntilde;adir, editar y aceptar;
derecho para cancellar. Hablando de direcci&oacute;n de movimiento del dedo.
</p> 
<H2>P&aacute;gina para buscar y agregar</H2>
<p>
Tecla letras de busqueda al campo al lado de la lupa <img src="../../images/icon-m-search.png" />,
y / o punta los que quedan a la lista.
Aceptar con "Aceptar" o deslizando izquierda.
</p>
<H2>La p&aacute;gina de editar un art&iacute;culo</H2>
<p>
La p&aacute; muestra los detalles ya conocidos del art&iacute;culo.
T&uacute;, como usuario tienes que ponerlos como quieras.
El campo tienda, tienes que elegir uno de los que hay.
En caso que no hay lo que quieres, tienes que pasar por el menu deslizante de la arriba, y coger el
&uacute;nico opci&oacute;n de Editar tiendas. (Algo m&aacute;s sobre esta m&aacute;s adelante.)
Aceptar con "Aceptar" o deslizando izquierda.
</p>
<h2>P&aacute;gina para editar tiendas</h2>
<p>
Se puede acceder a esta p&aacute;gina por el menu deslizante del arriba, donde esta puesta.
Muestra la lista de los nombres de las tiendas.
Cada uno de los l&iacute;neas tienen un menu de contexto, donde accesso a funciones editar
y borrar est&aacute;n ubicadas. Editar libera la linea para editaci&oacute;n, y borrar, como siempre,
borra el nombre de la tienda de la lista de las tiendas.
Aceptar cambios con "Aceptar" o deslizando izquierda.
</p>
<p>
Una nueva tienda se puede agregar desde el menu deslizante del arriba, opci&oacute;on
"A&ntilde;adir nueva tienda. Como antes, aceptar cambios con "Aceptar" o deslizando izquierda.

</p>
<h3>La lista de las tiendas y la significancia de los nombres de las tiendas</h3>
<p>
Los nombres de las tiendas est&aacute;n usador para filtrar la lista de compras, o,
tambien recordar donde comprar la cosita peque&ntilde;a.
The wildcard - * , star or asterisk will show all items on the list.
Cada uno de los art&iacute;culos tienen la propiedad, que se puede seleccionar o no.
</p>
</body>
</html>
</page>
